sizes_of_outerwear = {f'S': {'Россия':40, 'Бельгия,Германия,Нидерланды,Норвегия,Финляндия,Швеция':34, 'США':6, 'Франция, Швейцария':36, 'Великобритания':8, 'Италия':38},
f'M': {'Россия':(42, 44), 'Бельгия,Германия,Нидерланды,Норвегия,Финляндия,Швеция':(36, 38), 'США':(8, 10), 'Франция, Швейцария':(38, 40), 'Великобритания':(10, 12), 'Италия':(40, 42)},
f'L': {'Россия':(46, 48), 'Бельгия,Германия,Нидерланды,Норвегия,Финляндия,Швеция':(40, 42), 'США':(12, 14), 'Франция, Швейцария':(42, 44), 'Великобритания':(14, 16), 'Италия':(44, 46)},
f'XL': {'Россия':(50, 52), 'Бельгия,Германия,Нидерланды,Норвегия,Финляндия,Швеция':(44, 46), 'США':(16, 18), 'Франция, Швейцария':(46, 48), 'Великобритания':(18,20), 'Италия':(48, 50)},
f'XXL': {'Россия':54, 'Бельгия,Германия,Нидерланды,Норвегия,Финляндия,Швеция':48, 'США':20, 'Франция, Швейцария':50, 'Великобритания':22, 'Италия':52}}

print ('Верхняя одежда, платья и брюки')

def interpretation(sisizes_of_outerwearzes):
    print (list(sizes_of_outerwear.keys()))
    print('Выберете размер для перевода:')
    size = input()
    for i in sizes_of_outerwear.keys():
        if size == i:
            print('Размеры одежды в странах:', sizes_of_outerwear[i])

interpretation(sizes_of_outerwear)
